# Consider only the below columns and prepare a prediction model for predicting Price.

- **Price  -- Offer Price in EUROs**
- **Age_08_04 -- Age in months as in August 2004**
- **KM -- Accumulated Kilometers on odometer**
- **HP -- Horse Power**
- **cc -- Cylinder Volume in cubic centimeters**
- **Doors -- Number of doors**
- **Gears -- Number of gear positions**
- **Quarterly_Tax -- Quarterly road tax in EUROs**
- **Weight -- Weight in Kilograms**

## Attaching Resources

### Importing Necessary Libraries

In [104]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import statsmodels.formula.api as smf
import statsmodels.api as sm
from statsmodels.graphics.regressionplots import influence_plot
import warnings

warnings.filterwarnings('ignore')
plt.rcParams['figure.figsize'] = (10,5)
plt.rcParams['figure.dpi'] = 250
sns.set_style(style='darkgrid')

### Adding Dataset

In [105]:
tc = pd.read_csv('https://raw.githubusercontent.com/kunal-mallick/Data-Science-Assignments/main/Assignment_05_Multi%20Linear%20Regression/Dataset/ToyotaCorolla.csv', encoding='latin1')

In [106]:
tc = tc[['Price','Age_08_04','KM','HP','cc','Doors','Gears','Quarterly_Tax','Weight']]

tc.head()

   Price  Age_08_04     KM  HP    cc  Doors  Gears  Quarterly_Tax  Weight
0  13500         23  46986  90  2000      3      5            210    1165
1  13750         23  72937  90  2000      3      5            210    1165
2  13950         24  41711  90  2000      3      5            210    1165
3  14950         26  48000  90  2000      3      5            210    1165
4  13750         30  38500  90  2000      3      5            210    1170

## Performing EDA In Dataset

### Applying Descriptive Statistics

In [107]:
tc.describe()

,Price,Age_08_04,KM,HP,cc,Doors,Gears,Quarterly_Tax,Weight
count,1436.000000,1436.000000,1436.000000,1436.000000,1436.00000,1436.000000,1436.000000,1436.000000,1436.00000
mean,10730.824513,55.947075,68533.259749,101.502089,1576.85585,4.033426,5.026462,87.122563,1072.45961
std,3626.964585,18.599988,37506.448872,14.981080,424.38677,0.952677,0.188510,41.128611,52.64112
min,4350.000000,1.000000,1.000000,69.000000,1300.00000,2.000000,3.000000,19.000000,1000.00000
25%,8450.000000,44.000000,43000.000000,90.000000,1400.00000,3.000000,5.000000,69.000000,1040.00000
50%,9900.000000,61.000000,63389.500000,110.000000,1600.00000,4.000000,5.000000,85.000000,1070.00000
75%,11950.000000,70.000000,87020.750000,110.000000,1600.00000,5.000000,5.000000,85.000000,1085.00000
max,32500.000000,80.000000,243000.000000,192.000000,16000.00000,5.000000,6.000000,283.000000,1615.00000

In [108]:
tc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Price          1436 non-null   int64
 1   Age_08_04      1436 non-null   int64
 2   KM             1436 non-null   int64
 3   HP             1436 non-null   int64
 4   cc             1436 non-null   int64
 5   Doors          1436 non-null   int64
 6   Gears          1436 non-null   int64
 7   Quarterly_Tax  1436 non-null   int64
 8   Weight         1436 non-null   int64
dtypes: int64(9)
memory usage: 101.1 KB

In [109]:
tc.isna().sum()

Price            0
Age_08_04        0
KM               0
HP               0
cc               0
Doors            0
Gears            0
Quarterly_Tax    0
Weight           0
dtype: int64

In [110]:
def uni(df):
    
    for i in range(len(df.columns)):
        print('\n All Unique Value in '+ str(df.columns[i]) )
        print(np.sort(df[df.columns[i]].unique()))
        print('Total no of unique values ' + str(len(df[df.columns[i]].unique())))

In [111]:
uni(tc)

 All Unique Value in Price
[ 4350  4400  4450  4750  5150  5250  5600  5740  5750  5751  5800  5845
  5900  5950  6000  6150  6250  6400  6425  6450  6490  6495  6500  6550
  6640  6650  6750  6800  6900  6950  6990  6999  7000  7145  7150  7200
  7250  7300  7350  7400  7450  7460  7490  7495  7499  7500  7600  7750
  7795  7800  7850  7900  7950  7990  7995  7999  8000  8050  8100  8150
  8200  8250  8400  8450  8490  8495  8500  8600  8695  8700  8745  8750
  8800  8850  8895  8900  8950  8990  8995  9000  9130  9200  9245  9250
  9390  9400  9450  9475  9500  9550  9650  9695  9700  9750  9795  9799
  9800  9850  9895  9900  9930  9940  9950  9980  9990  9995 10000 10250
 10295 10350 10400 10450 10495 10500 10600 10750 10800 10845 10850 10895
 10900 10950 10990 10995 11000 11250 11290 11450 11480 11495 11500 11650
 11690 11695 11700 11710 11750 11790 11895 11900 11925 11930 11950 11990
 12000 12200 12250 12295 12400 12450 12495 12500 12695 12750 12850 12900
 12950 12995 13000 13250 13450 13500 13750 13875 13950 13995 14350 14750
 14900 14950 14990 15250 15450 15500 15750 15800 15850 15950 15999 16250
 16350 16450 16500 16650 16750 16868 16895 16900 16950 17200 17250 17450
 17495 17650 17795 17900 17950 18245 18450 18500 18600 18700 18750 18800
 18900 18950 18990 19000 19250 19450 19500 19600 19750 19900 19950 20500
 20750 20950 21125 21500 21750 21950 22000 22250 22500 22750 22950 23000
 23750 23950 24500 24950 24990 31000 31275 32500]
Total no of unique values 236

 All Unique Value in Age_08_04
[ 1  2  4  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 22 23 24 25 26 27
 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51
 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75
 76 77 78 79 80]
Total no of unique values 77

 All Unique Value in KM
[     1     15    225 ... 218118 232940 243000]
Total no of unique values 1263

 All Unique Value in HP
[ 69  71  72  73  86  90  97  98 107 110 116 192]
Total no of unique values 12

 All Unique Value in cc
[ 1300  1332  1398  1400  1587  1598  1600  1800  1900  1975  1995  2000
 16000]
Total no of unique values 13

 All Unique Value in Doors
[2 3 4 5]
Total no of unique values 4

 All Unique Value in Gears
[3 4 5 6]
Total no of unique values 4

 All Unique Value in Quarterly_Tax
[ 19  40  64  69  72  85 100 163 185 197 210 234 283]
Total no of unique values 13

 All Unique Value in Weight
[1000 1010 1015 1020 1025 1030 1035 1040 1045 1050 1055 1060 1065 1067
 1070 1075 1078 1079 1080 1083 1084 1085 1090 1094 1095 1100 1103 1105
 1109 1110 1114 1115 1119 1120 1121 1125 1130 1135 1140 1150 1155 1160
 1165 1170 1172 1180 1185 1195 1205 1245 1255 1260 1265 1270 1275 1280
 1320 1480 1615]
Total no of unique values 59

In [112]:
np.sort(tc['KM'].unique())

array([     1,     15,    225, ..., 218118, 232940, 243000], dtype=int64)

In [113]:
np.sort(tc['KM'].unique())[0]

1

- Just confirming Kilometers lowest value.